Pbl/app/controllers/recipes_controller.rb

    def videos
        @recipe = Recipe.find(params[:id])
        @videos = @recipe.videos
        @video = @videos.find_by(creator_id: @recipe.creator_id)
        @recipe_creator = User.find(@video.creator_id)
---
SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "videos".* FROM "videos" WHERE "videos"."recipe_id" = ? AND "videos"."creator_id" = ? LIMIT ?  [["recipe_id", 1], ["creator_id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def create
        @recipe = Recipe.new(recipe_params)
        @recipe.creator_id = current_user.id
        if @recipe.save
---
INSERT INTO "recipes" ("title", "description", "steps", "ingredient", "creator_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)