Pbl/app/controllers/video_comments_controller.rb

SELECT  "videos".* FROM "videos" WHERE "videos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "video_comments" ("user_id", "video_id", "comments", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["video_id", 1], ["comments", "いいですね"], ["created_at", "2020-08-27 06:33:15.083060"], ["updated_at", "2020-08-27 06:33:15.083060"]]
---
    def create
        video = Video.find(params[:video_id])
        comment = current_user.video_comments.new(video_comment_params)
        comment.video_id = video.id
        comment.save

DELETE FROM "video_comments" WHERE "video_comments"."id" = ?  [["id", 2]]
SELECT  "video_comments".* FROM "video_comments" WHERE "video_comments"."id" = ? AND "video_comments"."video_id" = ? LIMIT ?  [["id", 2], ["video_id", 1], ["LIMIT", 1]]
---
    def destroy
        VideoComment.find_by(id: params[:id], video_id: params[:video_id]).destroy