Pbl/app/controllers/video_favorites_controller.rb

SELECT  "videos".* FROM "videos" WHERE "videos"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
INSERT INTO "video_favorites" ("user_id", "video_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["video_id", 2], ["created_at", "2020-08-27 08:08:47.137381"], ["updated_at", "2020-08-27 08:08:47.137381"]]
---
    def create
        video = Video.find(params[:video_id])
        favorite = current_user.video_favorites.new(video_id: video.id)
        favorite.save

SELECT  "videos".* FROM "videos" WHERE "videos"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "video_favorites".* FROM "video_favorites" WHERE "video_favorites"."user_id" = ? AND "video_favorites"."video_id" = ? LIMIT ?  [["user_id", 1], ["video_id", 2], ["LIMIT", 1]]
DELETE FROM "video_favorites" WHERE "video_favorites"."id" = ?  [["id", 1]]
---
    def destroy
        video = Video.find(params[:video_id])
        favorite = current_user.video_favorites.find_by(video_id: video.id)
        favorite.destroy