Pbl/app/controllers/videos_controller.rb

SELECT  "videos".* FROM "videos" WHERE "videos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "videos".* FROM "videos" WHERE "videos"."recipe_id" = ? AND "videos"."id" != ? ORDER BY "videos"."id" ASC LIMIT ?  [["recipe_id", 3], ["id", 4], ["LIMIT", 5]]
SELECT  "recipes".* FROM "recipes" WHERE "recipes"."recipe_id" = ? LIMIT ?  [["recipe_id", 1], ["LIMIT", 1]]
SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show
        @video = Video.find(params[:id])
        @video_id = @video.url.gsub(/https:\/\/www.youtube.com\/watch\?v=(\w+)/){"#{$1}"}.first(11)
        @recipe = Recipe.find(@video.recipe_id)
        @video_comment = VideoComment.new
        @videos = @recipe.videos.where.not(id: @video.id)

INSERT INTO "videos" ("title", "description", "recipe_id", "url", "created_at", "updated_at", "creator_id") VALUES (?, ?, ?, ?, ?, ?, ?)
---
    def create
        @video = Video.new(video_params)
        @video.creator_id = current_user.id
        if @video.save

SELECT  "videos".* FROM "videos" WHERE "videos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def edit
        @video = Video.find(params[:id])

SELECT  "videos".* FROM "videos" WHERE "videos"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "videos" SET "title" = ?, "updated_at" = ? WHERE "videos"."id" = ?  [["title", "パンケーキ"], ["updated_at", "2020-08-27 07:46:31.403779"], ["id", 2]]
---
    def update
        @video = Video.find(params[:id])
        if @video.update(video_params)