Pbl/app/views/recipes/videos.html.erb

SELECT "videos".* FROM "videos" WHERE "videos"."recipe_id" = ?  [["recipe_id", 1]]
SELECT COUNT(*) FROM "video_favorites" WHERE "video_favorites"."video_id" = ?  [["video_id", 1]]
SELECT COUNT(*) FROM "video_comments" WHERE "video_comments"."video_id" = ?  [["video_id", 1]]
---
                                <i class="fa fa-heart" aria-hidden="true" style="color: red;"></i>
                                <%= @video.video_favorites.count %>
                                <i class="fa fa-comment"></i>
                                <%= @video.video_comments.count %>

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
                                by
                                <%= User.find(@video.creator_id).name %>

SELECT "videos".* FROM "videos" WHERE "videos"."recipe_id" = ?  [["recipe_id", 1]]
SELECT COUNT(*) FROM "video_favorites" WHERE "video_favorites"."video_id" = ?  [["video_id", 2]]
SELECT COUNT(*) FROM "video_comments" WHERE "video_comments"."video_id" = ?  [["video_id", 2]]
---
                                        <i class="fa fa-heart" aria-hidden="true" style="color: red;"></i>
                                        <%= video.video_favorites.count %>
                                        <i class="fa fa-comment"></i>
                                        <%= video.video_comments.count %>

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
                                        by
                                        <%= User.find(video.creator_id).name %>