Pbl/app/views/videos/show.html.erb

SELECT COUNT(*) FROM "video_favorites" WHERE "video_favorites"."video_id" = ?  [["video_id", 1]]
---
                            <% end %>
                            <%= @video.video_favorites.count %>

SELECT COUNT(*) FROM "video_favorites" WHERE "video_favorites"."video_id" = ?  [["video_id", 3]]
---
                            <% end %>
                            <%= @video.video_favorites.count %>

SELECT "video_comments".* FROM "video_comments" WHERE "video_comments"."video_id" = ?  [["video_id", 2]]
SELECT COUNT(*) FROM "video_comments" WHERE "video_comments"."video_id" = ?  [["video_id", 4]]
---
                            <i class="fa fa-comment"></i>
                            <%= @video.video_comments.count %>

SELECT COUNT(*) FROM "video_favorites" WHERE "video_favorites"."video_id" = ?  [["video_id", 5]]
SELECT "video_comments".* FROM "video_comments" WHERE "video_comments"."video_id" = ?  [["video_id", 1]]
SELECT COUNT(*) FROM "video_comments" WHERE "video_comments"."video_id" = ?  [["video_id", 5]]
---
                                        <i class="fa fa-heart" aria-hidden="true" style="color: red;"></i>
                                        <%= video.video_favorites.count %>
                                        <i class="fa fa-comment"></i>
                                        <%= video.video_comments.count %>

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
                                        by
                                        <%= User.find(video.creator_id).name %>

SELECT "video_comments".* FROM "video_comments" WHERE "video_comments"."video_id" = ?  [["video_id", 4]]
---
                <ol>
                    <% @video.video_comments.each do |post_comment| %>